---
title: "Smart Contract"
date: 2018-05-05T08:44:31+09:00
draft: false
---
## 스마트 컨트랙트


스마트 계약(smart contract)은 프로그래밍된 조건이 모두 충족되면 자동으로 계약을 이행하는 "자동화 계약" 시스템이다.
기존에는 계약이 체결되고 이행되기까지 수많은 문서가 필요했다면 스마트 계약은 계약 조건을 컴퓨터 코드로 지정해두고 
조건이 맞으면 계약을 이행하는 방식이다.
스마트 계약을 통해 사람들은 부동산, 주식 등 다양한 것을 거래할 수 있고 제 3자 없는 당사자간 거래가 가능하다.

1994년 암호학자이자 프로그래머인 닉 자보라는 분이 세상에 개념을 처음 선보였다.
닉 자보는 스마트 계약을 "계약에 필요한 요소를 코드를 통해 스스로 실행되게 하는 전산화된 거래 약속"이라 정의했다.
![Basic.png](https://cdn-images-1.medium.com/max/800/1*u_nTA0ECEr3Dc1vh6NlNlg.png)
![Smart.png](https://cdn-images-1.medium.com/max/800/1*VTzYHtsVJMhrOOwgLuS-kQ.png)
![Data.png](https://cdn-images-1.medium.com/max/800/1*bbJFblf4ZJPvhGGVoHY80A.png)
1996년 스마트 계약 설계의 기본원칙으로  관측 가능성(Observability), 검증 가능성(Verifiability), 사생활 보호(privity), 
강제 가능성(Enforceability) 4가지를 제시했다.



### 스마트 계약 설계의 기본원칙 


*서로의 계약 이행 가능성을 관찰하거나 성과를 입증할 수 있어야 하며 (관측 가능성)

*계약을 이행 또는 위반했을 때 이를 알 수 있어야한다(검증 가능성)

*계약 내용은 계약에 필요한 당사자들에게만 분배되어야 한다(사생활 보호)

*계약을 강제로 이행할 수 있는 구속력이 있어야 한다(강제 가능성)(etc 강제 가능성은 최소화해야 한다고 주장했다)



### 스마트 계약 활용 사례


*증권거래에 스마트 계약을 도입해 자동화 사례

나스닥의 경우 전문 투자자자용 장외시장 거래에 이를 적용

*의료 정보에 블록체인을 도입하는 아이디어 사례

의료진이 플랫폼에서 원하는 의료 데이터를 검색해 구매를 의뢰하면 
보상 정도에 따른 스마트 계약을 통해 데이터 주인이 자신의 의료 데이터를 판매하는 것



### 스마트 계약 문제점 및 보완점


*보안 문제

스마트 계약은 보통 계약서를 스크립트 형태로 주고 받게 되는데, 스크립트가 잘못되거나 정보가 유출될 가능성이 있다는
우려가 있으며 아직까지는 비교적 단순한 계약에 적용이 가능하다. 인간에 개입이 없을 경우 안전성을 보장받을 수 없다는
문제가 있습니다. 스마트 계약이 잘못되었을 때 막대한 대가를 치러야 할 수 있습니다. 잘못 작성된 스마트 계약으로 인해 
수많은 절도 및 부당 이용 사건이 발생 했으며, 몇몇 사건은 수천만 달러의 손실액으로 이어지기도 했습니다.

*난이도 문제

스마트 계약 방식이 대다수의 블록체인 프로젝트를 강력하게 만들어주지만, 일상적인 사용자 대다수는 여기에 접근하기 
어렵습니다. 어떤 스마트 계약 기능을 생성하려면 스마트 계약 프로그래밍 방법까지 알아야 합니다.

*변동성 문제

블록체인에 올라간 거래내역은 수정과 삭제가 불가능합니다. 
논문 '스마트 컨트랙트에서 개인정보 보호를 위한 설계 방안 연구'에서는 "개인정보보호법과 정보통신망 이용촉진 및 
정보보호 등에 관한 법률에 따르면 개인정보의 수집 목적 달성 또는 정보주체의 요청시 수집된 개인정보를 파기하여야 하는데 
블록체인에 올라간 거래내역은 수정과 삭제가 불가능하다는 점에서 이슈가 발생한다"고 했습니다.
